app/Controllers/API/PenginapanController.php

    public function index()
    {
        $data = [
            'message' => 'success',
            'data_penginapan' => $this->ModelPenginapan->orderBy('nama', 'asc')->findAll()
---
SELECT *
FROM `penginapan`
ORDER BY `nama` ASC