app/Controllers/API/WisataController.php

    public function index()
    {
        $data = [
            'message' => 'success',
            'data_wisata' => $this->ModelWisata->orderBy('nama', 'asc')->findAll()
---
SELECT *
FROM `wisata`
ORDER BY `nama` ASC