app/Controllers/Admin/AdminController.php

SELECT *
FROM `admin`
ORDER BY `id` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Admin',
            'daftar_admin' => $this->ModelAdmin->orderBy('id', 'DESC')->findAll()