app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard',
            'data_wisata' => $this->ModelWisata->countAllResults(),
            'data_penginapan' => $this->ModelPenginapan->countAllResults(),
            'data_admin' => $this->ModelAdmin->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `wisata`
SELECT COUNT(*) AS `numrows`
FROM `penginapan`
SELECT COUNT(*) AS `numrows`
FROM `admin`