app/Controllers/Admin/LoginController.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // $adminModel = new \App\Models\AdminModel();
        $admin = $this->ModelAdmin->where('username', $username)->first();