app/Controllers/Admin/PenginapanController.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Penginapan',
            'daftar_penginapan' => $this->ModelPenginapan->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `penginapan`
ORDER BY `id` DESC

        // Format tanggal dan waktu dalam format Indonesia
        $waktu_sekarang = $now->format('d F Y, H:i:s'); // Contoh: 10 Agustus 2023, 09:30:15

        $this->ModelPenginapan->insert([
            'slug_penginapan' => $slug_penginapan,
            'nama' => esc($this->request->getPost('nama')),
            'gambar' => $namaGambar,
            'deskripsi' => esc($this->request->getPost('deskripsi')),
            'alamat' => esc($this->request->getPost('alamat')),
            'latitude' => esc($this->request->getPost('latitude')),
            'longitude' => esc($this->request->getPost('longitude')),
            'created_at'        => $waktu_sekarang,
            'created_by'        => 'admin1',
        ]);
---
INSERT INTO `penginapan` (`slug_penginapan`, `nama`, `gambar`, `deskripsi`, `alamat`, `latitude`, `longitude`, `created_at`, `created_by`) VALUES ('hotel-grand-permata-hati', 'Hotel Grand Permata Hati', '1721922754_8482cf0d8d9a1dad0577.jpg', '&lt;p&gt;...&lt;/p&gt;', 'Jl. Sultan Iskandar Muda No.217, Blang Oi, Kec. Meuraxa, Kota Banda Aceh, Aceh 23233', '5.5527712955693165', '95.29800213604979', '25 July 2024, 22:52:34', 'admin1')

    public function update($id)
    {
        $data = [
            'title' => 'Ubah Penginapan',
            'data_penginapan' => $this->ModelPenginapan->find($id),
---
SELECT *
FROM `penginapan`
WHERE `penginapan`.`id` = '3'

        // Format tanggal dan waktu dalam format Indonesia
        $waktu_sekarang = $now->format('d F Y, H:i:s'); // Contoh: 10 Agustus 2023, 09:30:15

        $this->ModelPenginapan->update($id,[
            'slug_penginapan' => $slug_penginapan,
            'nama' => esc($this->request->getPost('nama')),
            'gambar' => $namaGambar,
            'deskripsi' => esc($this->request->getPost('deskripsi')),
            'alamat' => esc($this->request->getPost('alamat')),
            'latitude' => esc($this->request->getPost('latitude')),
            'longitude' => esc($this->request->getPost('longitude')),
            'updated_at' => $waktu_sekarang,
            'updated_by' => "admin2",
        ]);
---
UPDATE `penginapan` SET `slug_penginapan` = 'hotel-kyriad-muraya', `nama` = 'Hotel Kyriad Muraya', `gambar` = '1720371488_43d0fe2127d66502f670.jpg', `deskripsi` = '&lt;p&gt;...&lt;/p&gt;', `alamat` = 'Jl. Tgk. Moh. Daud Beureueh No.5, Laksana, Kec. Kuta Alam, Kota Banda Aceh, Aceh 23122', `latitude` = '5.5564826944350125', `longitude` = '95.32231336588761', `updated_at` = '25 July 2024, 22:42:05', `updated_by` = 'admin2'
WHERE `penginapan`.`id` IN ('3')