app/Controllers/Admin/WisataController.php

SELECT *
FROM `wisata`
ORDER BY `id` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Wisata',
            'daftar_wisata' => $this->ModelWisata->orderBy('id', 'DESC')->findAll()

SELECT *
FROM `wisata`
WHERE `wisata`.`id` = '8'
---
    public function update($id)
    {
        $data = [
            'title' => 'Ubah Wisata',
            'data_wisata' => $this->ModelWisata->find($id),